### 현직 개발자 인터뷰
#### 노수진 님(iOS, 네이버 웹툰)
#### 일자: 2020.01.28
> https://soojin.ro <br>
> 개발자를 위한 영어:
> https://speakerdeck.com/nsoojin/gaebaljareul-wihan-yeongeo-munbeob <br>

- 배울만한 남의 GitHub 코드 분석

- 면접: 대화하듯, 열정태도, 내 이력서 분석, 모르더라도 비슷한 내용 최대한 어필

- 신입 자질

  CS기초: 자료구조(all), 알고리즘(sort), http 통신(7layer), 운영체제(deadlock) ...

  각 언어 문법 등 왜 쓰는 지?

- 해외취업

  알고리즘, 포트폴리오, 1시간 자료구조 면접, 1시간 iOS면접, 1시간 매니저 면접 (이럴 땐 어떻게 대처)

- 네이버 채용

  공채, 핵 데이, .. 다양한 경로

- 기업 별 Job Description 분석

- 코딩테스트? 많이 풀고 유형 별 패턴 화, leetcode

- 알고리즘 코딩테스트 면접 시 무엇을 우선시 보는가?

  0) 코드 동작하는 가

  1) 시간 복잡도 O(n), edge case(예외처리) 가 중요

  2) 가독성(람다식) 등 이면 +

  3) 실행 속도(품질) 등 이면 +, 실제 동작속도는 코드도 중요하지만 아키텍처가 훨씬 더 영향을 줌
